_org/note/2013-04-14-Learning-Django.org
#+TITLE:Learning Django
#+AUTHOR:ICECREAM(氷菓)
#+EMAIL:creamidea(AT)gmail.com
#+DESCRIPTION:ICECREAM(氷菓)
#+KEYWORDS:python django
#+OPTIONS:H:4 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t email:t
#+LINK_HOME: https://creamidea.github.io
#+STYLE:<link rel="stylesheet" type="text/css" href="../css/style.css">
#+INFOJS_OPT: view: showall toc: nil

#+BEGIN_HTML
---
layout: doc
title: Learning Django
subtitle: 学习Python框架Django 
categories: note
tags: python django
---
#+END_HTML

* 前言
上面分配的新的学习内容，学习这个框架，然后使用的参考书籍是Django\_book\_2\_中文版。
下载地址是：[[http://vdisk.weibo.com/s/xy74T]]

无论有任何想法或者我文章中有任何错误，欢迎在下面留言或者通过电子邮件联系我：）

* Install Django
  因为安装过程理论上不是很难，我在这里只是写一条命令。（默认已经安装了python）
  1. Windows:
     以管理员的身份，打开cmd。之后到django文件夹下输入：
     #+BEGIN_SRC sh
       python setup.py install
     #+END_SRC
  2. Linux/Mac OS X:
	 前往django所在文件目录，之后输入：
	 #+BEGIN_SRC sh
       sudo python setup.py install
	 #+END_SRC

  *参考网站:*
  1. [[https://docs.djangoproject.com/en/1.5/topics/install/#installing-official-release]]
  2. [[https://docs.djangoproject.com/en/1.5/topics/install/]]
  3. https://docs.djangoproject.com/en/1.5/intro/install/

* 第二章 入门 && 第三章 视图和URL配置 日曜日<2013-04-14 Sun>
  只是稍微看了一下，然后写了一个Hello(呵呵，真是经典啊)
  1. 使用 =django-admin.py startproject mysite=
	 (笔者我在Windows7上尝试，估计路径没有加入，所以我直接将Scripts/django-admin.py
	 放入了工程文件夹才解决)。
	 
	 创建完成之后的目录：
	 #+BEGIN_EXAMPLE
	   icecream/
		   manage.py
		   icecream/
			   __init__.py   
			   settings.py   
			   urls.py   
			   wsgi.py
			   __init__.pyc  
			   settings.pyc  
			   urls.pyc  
			   wsgi.pyc
	 #+END_EXAMPLE
	 
  2. 创建views.py (注意这个要放在icecream这个目录下，同urls.py在同一目录)
	 #+BEGIN_SRC python
	   from django.http import HttpResponse
	   
	   def hello(request):
		   return HttpResponse("Hello, icecream")
	 #+END_SRC
	 
  3. 修改urls.py
	 #+BEGIN_SRC python
	   from django.conf.urls import patterns, include, url
	   from icecream.views import hello

	   urlpatterns = patterns('',
		   ('^hello/$', hello),        # 增加这句映射
	   )
	 #+END_SRC
	 
  4. 运行
	 #+BEGIN_SRC sh
	   python manage.py runserver [0.0.0.0] 8080
	   # 加入 0.0.0.0 可以使得“外网”访问，不仅限于127.0.0.1
	 #+END_SRC
	 
  5. 在浏览器中输入：
	 http://127.0.0.1:8080/hello
  
  P30
* 第四章 模板 火曜日<2013-04-16 Tue>
  1. Template System
	 #+BEGIN_SRC python :results output
       from django import template
       t = template.Template('My name is {{ name }}.')
       c = template.Context({'name': 'Alice'})
       print t.render(c)
	 #+END_SRC
  2. 给标签增加一个reversed使得该列表被反向迭代：
	 #+BEGIN_SRC python
       {% for athlete in athlete_list reversed %}
       ...
       {% endfor %}
	 #+END_SRC
* 第五章 模型 水曜日<2013-04-17 Wed>
  1. 安装python-mysql：

     在Windows7 64bit上貌似安装不了，它说是64bit的原因。
     (python version:2.7.3 64bit.)
     我想也是。
     
     我下载的包是：
     http://nchc.dl.sourceforge.net/project/mysql-python/mysql-python-test/1.2.4b4/MySQL-python-1.2.4b4.win32-py2.7.exe
	 
     然后我跟着：
     http://stackoverflow.com/questions/3652625/installing-setuptools-on-64-bit-windows
     修改注册表还是失败了。以后再试吧。

     在Linux上安装的话就下载源码安装呗。
     我以为直接下载源码，然后：
     #+BEGIN_SRC python
       python setup.py install
     #+END_SRC
     就可以了，但是我在ubuntu12.04上貌似失败了，貌似提示没有setuptool。我
     安装了python-setuptool也没有用。有谁会记得告诉我。
     
     Referencs:
     1. http://stackoverflow.com/questions/5178292/pip-install-mysql-python-fails-with-environmenterror-mysql-config-not-found
     2. http://stackoverflow.com/questions/14426491/python-3-importerror-no-module-named-setuptools
     3. http://stackoverflow.com/questions/2211335/python-setuptools-import-error-using-netbeans

     于是我改用 =pip= 安装。一开始我不是这个步骤，不是权限问题，就是没有
     distribute。现在我将步骤整理如下：
     From: http://codeinthehole.com/writing/how-to-set-up-mysql-for-python-on-ubuntu/
     #+BEGIN_SRC sh
       $ sudo apt-get install python-pip
       $ sudo apt-get install python-dev libmysqlclient-dev
       $ sudo easy_install -U distribute 
       $ sudo pip install MySQL-python
     #+END_SRC

     之后我尝试了一下(一定要保证能够连接到数据库哦，如果真想写进数据库，记得
     别忘了syncdb)：
     #+BEGIN_SRC sh
       $ python manage.py validate     # 验证数据正确性
       $ python manage.py sqlall books 
       $ python manage.py syncdb
     #+END_SRC
     
     RESULTS:
     #+BEGIN_SRC sh
       BEGIN;
       CREATE TABLE `books_publisher` (
           `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
           `name` varchar(30) NOT NULL,
           `address` varchar(50) NOT NULL,
           `city` varchar(60) NOT NULL,
           `state_province` varchar(30) NOT NULL,
           `country` varchar(50) NOT NULL,
           `website` varchar(200) NOT NULL
       )
       ;
       CREATE TABLE `books_author` (
           `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
           `first_name` varchar(30) NOT NULL,
           `last_name` varchar(40) NOT NULL,
           `email` varchar(75) NOT NULL
       )
       ;
       CREATE TABLE `books_book_authors` (
           `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
           `book_id` integer NOT NULL,
           `author_id` integer NOT NULL,
           UNIQUE (`book_id`, `author_id`)
       )
       ;
       ALTER TABLE `books_book_authors` ADD CONSTRAINT `author_id_refs_id_1a0a2829` FOREIGN KEY (`author_id`) REFERENCES `books_author` (`id`);
       CREATE TABLE `books_book` (
           `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
           `title` varchar(100) NOT NULL,
           `publisher_id` integer NOT NULL,
           `publisher_date` date NOT NULL
       )
       ;
       ALTER TABLE `books_book` ADD CONSTRAINT `publisher_id_refs_id_974c2a46` FOREIGN KEY (`publisher_id`) REFERENCES `books_publisher` (`id`);
       ALTER TABLE `books_book_authors` ADD CONSTRAINT `book_id_refs_id_0a3634f3` FOREIGN KEY (`book_id`) REFERENCES `books_book` (`id`);
       CREATE INDEX `books_book_81b79144` ON `books_book` (`publisher_id`);
       
       COMMIT;
     #+END_SRC

  2. 如果使用Django的数据层，必须创建Django app.
     #+BEGIN_SRC sh
      $ python manage.py startapp books(app name)
     #+END_SRC

  3. 使用get()方法处理“可能不存在的键”
     #+BEGIN_SRC python
       request.META.get('HTTP_USER_AGENT', 'unknow')
     #+END_SRC

  4. 使用Sqlite3 （因为笔者最近在Windows7上开发，又不想安装中大型数据库，于是。。。）:

	 For Windows7:

	 1. 下载源代码：sqlite-amalgamation-xxxxxxx.zip,点击这里进入下载页面。

	 2. 输入编译代码，前提是安装了 [[http://www.mingw.org/][MinGW]] :
		#+BEGIN_SRC sh
          gcc -o sqlite3 shell.c sqlite3.c -lpthread
          # 这里需要去掉-ldl，不然会保错。不知道你们安装的时候会不会遇到此类问题.
		#+END_SRC
		Reference:
		+ http://www.sqlite.org/howtocompile.html

