_posts/2013-04-14-Learning-Django.html
---
layout: doc
title: Learning Django
subtitle: 学习Python框架Django 
categories: note
tags: python django
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 Install Django</a></li>
<li><a href="#sec-3">3 第二章 入门 &amp;&amp; 第三章 视图和URL配置</a></li>
<li><a href="#sec-4">4 第四章 模板</a></li>
<li><a href="#sec-5">5 第五章 模型</a>
<ul>
<li><a href="#sec-5-1">5.1 MTV开发模式</a></li>
</ul>
</li>
<li><a href="#sec-6">6 第六章 Django站点管理</a></li>
<li><a href="#sec-7">7 第七章 表单</a></li>
<li><a href="#sec-8">8 第八章 高级视图和URL配置</a></li>
<li><a href="#sec-9">9 第九章 模板高级进阶</a></li>
<li><a href="#sec-10">10 第十章 数据模型高级进阶</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">

<p>上面分配的新的学习内容，学习这个框架，然后使用的参考书籍是Django_book_2_中文版。
下载地址是：<a href="http://vdisk.weibo.com/s/xy74T">http://vdisk.weibo.com/s/xy74T</a>
</p>
<p>
无论有任何想法或者我文章中有任何错误，欢迎在下面留言或者通过电子邮件联系我：）
</p>
<p>
 <span class="timestamp-wrapper"> <span class="timestamp">2013-09-28 Sat</span></span>再次学习
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Install Django</h2>
<div class="outline-text-2" id="text-2">

<p>  因为安装过程理论上不是很难，我在这里只是写一条命令。（默认已经安装了python）
</p><ol>
<li>Windows:
     以管理员的身份，打开cmd。之后到django文件夹下输入：



<pre class="example">python setup.py install
</pre>

</li>
<li>Linux/Mac OS X:
   前往django所在文件目录，之后输入：



<pre class="example">sudo python setup.py install
</pre>

</li>
</ol>


<p>
  <b>参考网站:</b>
</p><ol>
<li><a href="https://docs.djangoproject.com/en/1.5/topics/install/#installing-official-release">https://docs.djangoproject.com/en/1.5/topics/install/#installing-official-release</a>
</li>
<li><a href="https://docs.djangoproject.com/en/1.5/topics/install/">https://docs.djangoproject.com/en/1.5/topics/install/</a>
</li>
<li><a href="https://docs.djangoproject.com/en/1.5/intro/install/">https://docs.djangoproject.com/en/1.5/intro/install/</a>
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">第二章 入门 &amp;&amp; 第三章 视图和URL配置</h2>
<div class="outline-text-2" id="text-3">

<p>  日曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-14 Sun</span></span>
</p>
<p>
  只是稍微看了一下，然后写了一个Hello(呵呵，真是经典啊)
</p><ol>
<li>使用 <code>django-admin.py startproject mysite</code>
   (笔者我在Windows7上尝试，估计路径没有加入，所以我直接将Scripts/django-admin.py
   放入了工程文件夹才解决)。

<p>   
   创建完成之后的目录：
</p>


<pre class="example">icecream/
  manage.py
  icecream/
    __init__.py   
    settings.py   
    urls.py   
    wsgi.py
    __init__.pyc  
    settings.pyc  
    urls.pyc  
    wsgi.pyc
</pre>


</li>
<li>创建views.py (注意这个要放在icecream这个目录下，同urls.py在同一目录)



<pre class="example">from django.http import HttpResponse

def hello(request):
  return HttpResponse("Hello, icecream")
</pre>


</li>
<li>修改urls.py



<pre class="example">from django.conf.urls import patterns, include, url
from icecream.views import hello

urlpatterns = patterns('',
  ('^hello/$', hello),        # 增加这句映射
)
</pre>


</li>
<li>运行



<pre class="example">python manage.py runserver [0.0.0.0] 8080
# 加入 0.0.0.0 可以使得“外网”访问，不仅限于127.0.0.1
</pre>


</li>
<li>在浏览器中输入：
   <a href="http://127.0.0.1:8080/hello">http://127.0.0.1:8080/hello</a>
</li>
</ol>


<p>  
  P30
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">第四章 模板</h2>
<div class="outline-text-2" id="text-4">

<p>  火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-16 Tue</span></span>
</p>
<ol>
<li>Template System



<pre class="example">from django import template
t = template.Template('My name is {{ name }}.')
c = template.Context({'name': 'Alice'})
print t.render(c)
</pre>

</li>
<li>给标签增加一个reversed使得该列表被反向迭代：



<pre class="example">{% for athlete in athlete_list reversed %}
...
{% endfor %}
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">第五章 模型</h2>
<div class="outline-text-2" id="text-5">

<p>  水曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-17 Wed</span></span>
</p>
<ol>
<li>安装python-mysql：

<p>
     在Windows7 64bit上貌似安装不了，它说是64bit的原因。
     (python version:2.7.3 64bit.)
     我想也是。
</p>
<p>     
     我下载的包是：
     <a href="http://nchc.dl.sourceforge.net/project/mysql-python/mysql-python-test/1.2.4b4/MySQL-python-1.2.4b4.win32-py2.7.exe">http://nchc.dl.sourceforge.net/project/mysql-python/mysql-python-test/1.2.4b4/MySQL-python-1.2.4b4.win32-py2.7.exe</a>
</p>
<p>   
     然后我跟着：
     <a href="http://stackoverflow.com/questions/3652625/installing-setuptools-on-64-bit-windows">http://stackoverflow.com/questions/3652625/installing-setuptools-on-64-bit-windows</a>
     修改注册表还是失败了。以后再试吧。
</p>
<p>
     在Linux上安装的话就下载源码安装呗。
     我以为直接下载源码，然后：
</p>


<pre class="example">python setup.py install
</pre>

<p>
     就可以了，但是我在ubuntu12.04上貌似失败了，貌似提示没有setuptool。我
     安装了python-setuptool也没有用。有谁会记得告诉我。
</p>
<p>     
     Referencs:
</p><ol>
<li><a href="http://stackoverflow.com/questions/5178292/pip-install-mysql-python-fails-with-environmenterror-mysql-config-not-found">http://stackoverflow.com/questions/5178292/pip-install-mysql-python-fails-with-environmenterror-mysql-config-not-found</a>
</li>
<li><a href="http://stackoverflow.com/questions/14426491/python-3-importerror-no-module-named-setuptools">http://stackoverflow.com/questions/14426491/python-3-importerror-no-module-named-setuptools</a>
</li>
<li><a href="http://stackoverflow.com/questions/2211335/python-setuptools-import-error-using-netbeans">http://stackoverflow.com/questions/2211335/python-setuptools-import-error-using-netbeans</a>

</li>
</ol>

<p>     于是我改用 <code>pip</code> 安装。一开始我不是这个步骤，不是权限问题，就是没有
     distribute。现在我将步骤整理如下：
     From: <a href="http://codeinthehole.com/writing/how-to-set-up-mysql-for-python-on-ubuntu/">http://codeinthehole.com/writing/how-to-set-up-mysql-for-python-on-ubuntu/</a>
</p>


<pre class="example">$ sudo apt-get install python-pip
$ sudo apt-get install python-dev libmysqlclient-dev
$ sudo easy_install -U distribute 
$ sudo pip install MySQL-python
</pre>


<p>
     之后我尝试了一下(一定要保证能够连接到数据库哦，如果真想写进数据库，记得
     别忘了syncdb)：
</p>


<pre class="example">$ python manage.py validate     # 验证数据正确性
$ python manage.py sqlall books 
$ python manage.py syncdb
</pre>


<p>     
     RESULTS:
</p>


<pre class="example">BEGIN;
CREATE TABLE `books_publisher` (
    `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
    `name` varchar(30) NOT NULL,
    `address` varchar(50) NOT NULL,
    `city` varchar(60) NOT NULL,
    `state_province` varchar(30) NOT NULL,
    `country` varchar(50) NOT NULL,
    `website` varchar(200) NOT NULL
)
;
CREATE TABLE `books_author` (
    `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
    `first_name` varchar(30) NOT NULL,
    `last_name` varchar(40) NOT NULL,
    `email` varchar(75) NOT NULL
)
;
CREATE TABLE `books_book_authors` (
    `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
    `book_id` integer NOT NULL,
    `author_id` integer NOT NULL,
    UNIQUE (`book_id`, `author_id`)
)
;
ALTER TABLE `books_book_authors` ADD CONSTRAINT `author_id_refs_id_1a0a2829` FOREIGN KEY (`author_id`) REFERENCES `books_author` (`id`);
CREATE TABLE `books_book` (
    `id` integer AUTO_INCREMENT NOT NULL PRIMARY KEY,
    `title` varchar(100) NOT NULL,
    `publisher_id` integer NOT NULL,
    `publisher_date` date NOT NULL
)
;
ALTER TABLE `books_book` ADD CONSTRAINT `publisher_id_refs_id_974c2a46` FOREIGN KEY (`publisher_id`) REFERENCES `books_publisher` (`id`);
ALTER TABLE `books_book_authors` ADD CONSTRAINT `book_id_refs_id_0a3634f3` FOREIGN KEY (`book_id`) REFERENCES `books_book` (`id`);
CREATE INDEX `books_book_81b79144` ON `books_book` (`publisher_id`);

COMMIT;
</pre>


</li>
<li>如果使用Django的数据层，必须创建Django app.



<pre class="example">$ python manage.py startapp books(app name)
</pre>


</li>
<li>使用get()方法处理“可能不存在的键”



<pre class="example">request.META.get('HTTP_USER_AGENT', 'unknow')
</pre>


</li>
<li>使用Sqlite3 （因为笔者最近在Windows7上开发，又不想安装中大型数据库，于是。。。）:

<p>
   For Windows7:
</p>
<ol>
<li>下载源代码：sqlite-amalgamation-xxxxxxx.zip,点击这里进入下载页面。

</li>
<li>输入编译代码，前提是安装了 <a href="http://www.mingw.org/">MinGW</a> :



<pre class="example">gcc -o sqlite3 shell.c sqlite3.c -lpthread
# 这里需要去掉-ldl，不然会保错。不知道你们安装的时候会不会遇到此类问题.
</pre>

<p>
    Reference:
</p><ul>
<li><a href="http://www.sqlite.org/howtocompile.html">http://www.sqlite.org/howtocompile.html</a>
</li>
</ul>

</li>
</ol>

</li>
</ol>



</div>
