_org/note/2013-04-14-Learning-Django.org
* 第六章 Django站点管理 火曜日<2013-04-23 Tue>
1. 搭建步骤
   #+BEGIN_EXAMPLE
     #INSTALLED_APPS
     1. django.contrib.admin         #enable
     2. django.contrib.auth
        django.contrib.contenttypes
        django.contrib.session
     
     #MIDDLEWARE_CLASSES
     1. django.middleware.common.CommonMiddleware
     2. django.contrib.sessons.middleware.SessionMiddleware
     3. django.contrib.auth.middleware.AuthenticationMiddleware
   #+END_EXAMPLE
2. Some config
   1)Setting.py
     + Template paht:
       #+BEGIN_SRC python
         TEMPLATE_DIRS = (
             # Put strings here, like "/home/html/django_templates" or "C:/www/django/templates".
             # Always use forward slashes, even on Windows.
             # Don't forget to use absolute paths, not relative paths.
             os.path.join(os.path.dirname(__file__), 'templates').replace('\\', '/'),
         )
       #+END_SRC
     + Static path
       #+BEGIN_SRC python
         # Additional locations of static files
         STATICFILES_DIRS = (
             # Put strings here, like "/home/html/static" or "C:/www/django/static".
             # Always use forward slashes, even on Windows.
             # Don't forget to use absolute paths, not relative paths.
             os.path.join(os.path.dirname(__file__), 'static').replace('\\', '/'),
         )
       #+END_SRC
   2)一些注意点
	 1. 在管理界面显示自己创建的应用程序：
	    这点我也是我自己要记住的，记住写的模型需要在当前应用程序下的admin.py中注册，
	    代码类似这样：
	    #+BEGIN_SRC python
          from django.contrib import admin
          from icecream.register.models import User
           
          admin.site.register(User)
	    #+END_SRC
* COMMENT 第七章 表单 木曜日<2013-04-25 Thu>
  1. 在创建contact的时候，我没有使用 =python manage.py startapp contact= 
     导致在写urls.py的时候老是提示找不到 =contact=

  2. 自定义校验规则
     #+BEGIN_EXAMPLE
     Django的form系统自动寻找匹配的函数方法,
     该方法名称以clean_开头,并以字段名称结束。 
     如果有这样的方法,它将在校验时被调用。

     特别地,clean_message()方法将在指定字段的默认校验逻辑执行 *之后* 被调用。
     (本例中,在必填CharField这个校验逻辑之后。)
     因为字段数据已经被部分处理,所以它被从self.cleaned_data中提取出来
     了。同样,我们不必担心数据是否为空,因为它已经被校验过了。

     我们简单地使用了len()和split()的组合来计算单词的数量。 
     如果用户输入字数不足,我们抛出一个forms.ValidationError型异常。
     这个异常的描述会被作为错误列表中的一项显示给用户。

     在函数的末尾显式地返回字段的值非常重要。 
     我们可以在我们自定义的校验方法中修改它的值(或者把它转换
     成另一种Python类型)。 如果我们忘记了这一步,None值就会返回,
     原始的数据就丢失掉了。     
     #+END_EXAMPLE
     
  3. 定义Form样式
     #+BEGIN_EXAMPLE
       每一个字段部件(<input type=”text”>, <select>, <textarea>, 或者类似)都可以通过访问{{form.字段名}}进行单独的渲染。
     #+END_EXAMPLE

  4. 问题解决：
		 1) CSRF verification failed. Request aborted.
			#+BEGIN_SRC python
						# views.py
						from django.template import RequestContext
						return render_to_response('login.html', context_instance=RequestContext(request))
          
						# login.html
			#+END_SRC

			Reference:
				1) http://stackoverflow.com/questions/14848603/django-csrf-cookie-not-setting

				2) http://www.5i1y.com/post/8/Django-CSRF/

				3) https://docs.djangoproject.com/en/dev/ref/templates/api/#subclassing-context-requestcontext
* 第八章 高级视图和URL配置 木曜日<2013-04-25 Thu>
  1. 在 Python 正则表达式中,命名的正则表达式组的语法是 =(?P<name>pattern)= ,
     这里 =name= 是组的名字,而 =pattern= 是匹配的某个模式。
     
     下面使用无名组的URLconf例子：
     #+BEGIN_SRC python
       from django.conf.urls.defaults import *
       from mysite import views
       urlpatterns = patterns('',
                              (r'^articles/(\d{4})/$', views.year_archive),
                              (r'^articles/(\d{4})/(\d{2})/$', views.month_archive),
       )
       
     #+END_SRC
     
     下面相同的URLconf:
     #+BEGIN_SRC python
       from django.conf.urls.defaults import *
       from mysite import views
       urlpatterns = patterns('',
                              (r'^articles/(?P<year>\d{4})/$', views.year_archive),
                              (r'^articles/(?P<year>\d{4})/(?P<month>\d{2})/$', views.month_archive),
       )
       
            
     #+END_SRC

     例如,如果不带命名组,请求 
     =/articles/2006/03/= 
     将会等同于这样的函数调用:
     #+BEGIN_SRC python
       =month_archive(request, '2006', '03')=
     #+END_SRC

     而带命名组,同样的请求就会变成这样的函数调用:
     #+BEGIN_SRC python
       month_archive(request, year\='2006', month='03')
     #+END_SRC

  2. 对一个可选URL配置参数的优雅解决方法: 
     URLconf里面的每一个模式都可以包含第三个数据: 一个关键字参数的字典:
     有了这个概念以后,我们就可以把我们现在的例子改写成这样:
     #+BEGIN_SRC python
       # urls.py
       from django.conf.urls.defaults import *
       from mysite import views
       urlpatterns = patterns('',
           (r'^foo/$', views.foobar_view, {'template_name': 'template1.html'}),
           (r'^bar/$', views.foobar_view, {'template_name': 'template2.html'}),
       )     
       # views.py
       from django.shortcuts import render_to_response
       from mysite.models import MyModel
       def foobar_view(request, template_name):
           m_list = MyModel.objects.filter(is_new=True)
           return render_to_response(template_name, {'m_list': m_list})
     #+END_SRC
     
     如你所见,这个例子中,URLconf指定了 template\_name 。 而视图函数会把它当成另一个参数。

  3. 比如你可能会想增加这样一个URL, /mydata/birthday/ , 
     这个URL等价于 /mydata/jan/06/ 。这时你可以这样利用额外URLconf参数:
     #+BEGIN_SRC python
       urlpatterns = patterns('',
           (r'^mydata/birthday/$', views.my_view, {'month': 'jan', 'day': '06'}),
           (r'^mydata/(?P<month>\w{3})/(?P<day>\d\d)/$', views.my_view),
       )     
     #+END_SRC
 
     在这里最帅的地方莫过于你根本不用改变你的视图函数。 
     视图函数只会关心它获得了参数,
     它不会去管这些参数到底是捕捉回来的还是被额外提供的。
     month和day

* 第九章 模板高级进阶 木曜日<2013-05-07 Tue>  

  1. 关闭html自动转义
	 + 对于单独的变量

       用safe过滤器为单独的变量关闭自动转意：
	   #+BEGIN_SRC python
         This will be escaped: {{ data }}
         This will not be escaped: {{ data|safe }}
	   #+END_SRC

       你可以把safe当做safe from further escaping的简写，或者当做可以被直接译成HTML的内容。在这个例子
       里，如果数据包含''，那么输出会变成：
	   #+BEGIN_SRC python
         This will be escaped: &lt;b&gt;
         This will not be escaped: <b>
	   #+END_SRC

	 + 对于模板块

	   为了控制模板的自动转意,用标签 =autoescape= 来包装整个模板(或者模板中常用的部分),就像这样：
	   #+BEGIN_SRC python
         {&#37; autoescape off &#37;}
         Hello {&#123; name &#123;}
         {&#37; endautoescape &#37;}       
	   #+END_SRC
       
       auto-escaping 标签的作用域不仅可以影响到当前模板还可以通过
       include标签作用到其他标签,就像block标签一样。

  2. Django有两种方法加载模板
     + django.template.loader.get\_template(template\_name) ： 
       get\_template 根据给定的模板名称返回一个
       已编译的模板（一个 Template 对象）。 
       如果模板不存在，就触发 TemplateDoesNotExist 的异常。
     + django.template.loader.select\_template(template\_name\_list) ： 
       select\_template 很像get\_template ，不过它是以模板名称的列表作为参数的。 
       它会返回列表中存在的第一个模板。 如果模板都不存在，
       将会触发TemplateDoesNotExist异常。

