_posts/2013-04-14-Learning-Django.html

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">MTV开发模式</h3>
<div class="outline-text-3" id="text-5-1">

<p>   <i>Model-View-Controller</i>
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">第六章 Django站点管理</h2>
<div class="outline-text-2" id="text-6">

<p>  火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-23 Tue</span></span>
</p>
<ol>
<li>搭建步骤



<pre class="example">#INSTALLED_APPS
1. django.contrib.admin         #enable
2. django.contrib.auth
   django.contrib.contenttypes
   django.contrib.session

#MIDDLEWARE_CLASSES
1. django.middleware.common.CommonMiddleware
2. django.contrib.sessons.middleware.SessionMiddleware
3. django.contrib.auth.middleware.AuthenticationMiddleware
</pre>

</li>
<li>Some config
   1)Setting.py
<ul>
<li>Template paht:



<pre class="example">TEMPLATE_DIRS = (
    # Put strings here, like "/home/html/django_templates" or "C:/www/django/templates".
    # Always use forward slashes, even on Windows.
    # Don't forget to use absolute paths, not relative paths.
    os.path.join(os.path.dirname(__file__), 'templates').replace('\\', '/'),
)
</pre>

</li>
<li>Static path



<pre class="example"># Additional locations of static files
STATICFILES_DIRS = (
    # Put strings here, like "/home/html/static" or "C:/www/django/static".
    # Always use forward slashes, even on Windows.
    # Don't forget to use absolute paths, not relative paths.
    os.path.join(os.path.dirname(__file__), 'static').replace('\\', '/'),
)
</pre>

</li>
</ul>

<p>   2)一些注意点
</p><ol>
<li>在管理界面显示自己创建的应用程序：
      这点我也是我自己要记住的，记住写的模型需要在当前应用程序下的admin.py中注册，
      代码类似这样：



<pre class="example">from django.contrib import admin
from icecream.register.models import User

admin.site.register(User)
</pre>

</li>
</ol>

</li>
</ol>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">第七章 表单</h2>
<div class="outline-text-2" id="text-7">

<p>  木曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-25 Thu</span></span>
</p>
<ol>
<li>在创建contact的时候，我没有使用 <code>python manage.py startapp contact</code> 
     导致在写urls.py的时候老是提示找不到 <code>contact</code>

</li>
<li>自定义校验规则



<pre class="example">Django的form系统自动寻找匹配的函数方法,
该方法名称以clean_开头,并以字段名称结束。 
如果有这样的方法,它将在校验时被调用。

特别地,clean_message()方法将在指定字段的默认校验逻辑执行 *之后* 被调用。
(本例中,在必填CharField这个校验逻辑之后。)
因为字段数据已经被部分处理,所以它被从self.cleaned_data中提取出来
了。同样,我们不必担心数据是否为空,因为它已经被校验过了。

我们简单地使用了len()和split()的组合来计算单词的数量。 
如果用户输入字数不足,我们抛出一个forms.ValidationError型异常。
这个异常的描述会被作为错误列表中的一项显示给用户。

在函数的末尾显式地返回字段的值非常重要。 
我们可以在我们自定义的校验方法中修改它的值(或者把它转换
成另一种Python类型)。 如果我们忘记了这一步,None值就会返回,
原始的数据就丢失掉了。     
</pre>


</li>
<li>定义Form样式



<pre class="example">每一个字段部件(&lt;input type=”text”&gt;, &lt;select&gt;, &lt;textarea&gt;, 或者类似)都可以通过访问{{form.字段名}}进行单独的渲染。
</pre>


</li>
<li>问题解决：
<ol>
<li>CSRF verification failed. Request aborted.



<pre class="example"># views.py
from django.template import RequestContext
return render_to_response('login.html', context_instance=RequestContext(request))

# login.html
</pre>


<p>
      Reference:
</p><ol>
<li><a href="http://stackoverflow.com/questions/14848603/django-csrf-cookie-not-setting">http://stackoverflow.com/questions/14848603/django-csrf-cookie-not-setting</a>

</li>
<li><a href="http://www.5i1y.com/post/8/Django-CSRF/">http://www.5i1y.com/post/8/Django-CSRF/</a>

</li>
<li><a href="https://docs.djangoproject.com/en/dev/ref/templates/api/#subclassing-context-requestcontext">https://docs.djangoproject.com/en/dev/ref/templates/api/#subclassing-context-requestcontext</a>
</li>
</ol>

</li>
</ol>

</li>
</ol>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">第八章 高级视图和URL配置</h2>
<div class="outline-text-2" id="text-8">

<p>  木曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-25 Thu</span></span>
</p>
<ol>
<li>在 Python 正则表达式中,命名的正则表达式组的语法是 <code>(?P&lt;name&gt;pattern)</code> ,
     这里 <code>name</code> 是组的名字,而 <code>pattern</code> 是匹配的某个模式。

<p>     
     下面使用无名组的URLconf例子：
</p>


<pre class="example">from django.conf.urls.defaults import *
from mysite import views
urlpatterns = patterns('',
                       (r'^articles/(\d{4})/$', views.year_archive),
                       (r'^articles/(\d{4})/(\d{2})/$', views.month_archive),
)

</pre>


<p>     
     下面相同的URLconf:
</p>


<pre class="example">from django.conf.urls.defaults import *
from mysite import views
urlpatterns = patterns('',
                       (r'^articles/(?P&lt;year&gt;\d{4})/$', views.year_archive),
                       (r'^articles/(?P&lt;year&gt;\d{4})/(?P&lt;month&gt;\d{2})/$', views.month_archive),
)


</pre>


<p>
     例如,如果不带命名组,请求 
     <code>/articles/2006/03/</code> 
     将会等同于这样的函数调用:
</p>


<pre class="example">month_archive(request, '2006', '03')
</pre>


<p>
     而带命名组,同样的请求就会变成这样的函数调用:
</p>


<pre class="example">month_archive(request, year='2006', month='03')
</pre>


</li>
<li>对一个可选URL配置参数的优雅解决方法: 
     URLconf里面的每一个模式都可以包含第三个数据: 一个关键字参数的字典:
     有了这个概念以后,我们就可以把我们现在的例子改写成这样:



<pre class="example"># urls.py
from django.conf.urls.defaults import *
from mysite import views
urlpatterns = patterns('',
    (r'^foo/$', views.foobar_view, {'template_name': 'template1.html'}),
    (r'^bar/$', views.foobar_view, {'template_name': 'template2.html'}),
)     
# views.py
from django.shortcuts import render_to_response
from mysite.models import MyModel
def foobar_view(request, template_name):
    m_list = MyModel.objects.filter(is_new=True)
    return render_to_response(template_name, {'m_list': m_list})
</pre>


<p>     
     如你所见,这个例子中,URLconf指定了 template_name 。 而视图函数会把它当成另一个参数。
</p>
</li>
<li>比如你可能会想增加这样一个URL, <i>mydata/birthday</i> , 
     这个URL等价于 <i>mydata/jan/06</i> 。这时你可以这样利用额外URLconf参数:



<pre class="example">urlpatterns = patterns('',
    (r'^mydata/birthday/$', views.my_view, {'month': 'jan', 'day': '06'}),
    (r'^mydata/(?P&lt;month&gt;\w{3})/(?P&lt;day&gt;\d\d)/$', views.my_view),
)     
</pre>


<p> 
     在这里最帅的地方莫过于你根本不用改变你的视图函数。 
     视图函数只会关心它获得了参数,
     它不会去管这些参数到底是捕捉回来的还是被额外提供的。
     month和day
</p></li>
</ol>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">第九章 模板高级进阶</h2>
<div class="outline-text-2" id="text-9">

<p>  木曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-05-07 Tue</span></span>  
</p>
<ol>
<li>关闭html自动转义
<ul>
<li>对于单独的变量

<p>
       用safe过滤器为单独的变量关闭自动转意：
</p>


<pre class="example">This will be escaped: {{ data }}
This will not be escaped: {{ data|safe }}
</pre>


<p>
       你可以把safe当做safe from further escaping的简写，或者当做可以被直接译成HTML的内容。在这个例子
       里，如果数据包含''，那么输出会变成：
</p>


<pre class="example">This will be escaped: &amp;lt;b&amp;gt;
This will not be escaped: &lt;b&gt;
</pre>


</li>
<li>对于模板块

<p>
     为了控制模板的自动转意,用标签 <code>autoescape</code> 来包装整个模板(或者模板中常用的部分),就像这样：
</p>


<pre class="example"># &amp;#37; = % &amp;#123; = { 
{&amp;#37; autoescape off &amp;#37;}
Hello {&amp;#123; name &amp;#123;}
{&amp;#37; endautoescape &amp;#37;}       
</pre>


<p>       
       auto-escaping 标签的作用域不仅可以影响到当前模板还可以通过
       include标签作用到其他标签,就像block标签一样。
</p>
</li>
</ul>

</li>
<li>Django有两种方法加载模板
<ul>
<li>django.template.loader.get_template(template_name) ： 
       get_template 根据给定的模板名称返回一个
       已编译的模板（一个 Template 对象）。 
       如果模板不存在，就触发 TemplateDoesNotExist 的异常。
</li>
<li>django.template.loader.select_template(template_name_list) ： 
       select_template 很像get_template ，不过它是以模板名称的列表作为参数的。 
       它会返回列表中存在的第一个模板。 如果模板都不存在，
       将会触发TemplateDoesNotExist异常。
</li>
</ul>

</li>
</ol>


</div>

</div>
