_org/note/2013-04-14-Learning-Django.org
* 第十章 数据模型高级进阶 土曜日<2013-05-11 Sat>
  CLOCK: [2013-05-12 Sun 12:53]
  
  1. 打开Session功能：
	 #+BEGIN_SRC python
       'django.contrib.sessions.middleware.SessionMiddleware'
       
       INSTALLED_APPS 中有 'django.contrib.sessions'
       
       (别忘了运行manage.py syncdb)
       
	 #+END_SRC
  2. 在视图中使用Session
	 + SessionMiddleware 激活后，每个传给视图(view)函数的第一个参数``HttpRequest`` 
       对象都有一个 session 属性，这是一个字典型的对象。
  3. 会话密钥(session key)
  4. 设置Cookies:
	 =request.session.set_test_cookie()=
	 后续view中：
	 =request.seesion.test_cookie_worked()=
  5. 认证(authentication)框架
  6. 注意点：
	 + =session= 是在 =request= 中的， =set_cookie= 是在 =response=HttpResponse=

	 + 被设置的 =session= 并不会在调试工具中的cookie出现

  7. 疑问点：
	 + 关于这些session属性怎么设置，直接写入setting.py文件么？
	   参考地址：https://docs.djangoproject.com/en/dev/ref/settings/#sessions

	 + 在设计登录表单时，如何判断输入的是合法字符，使得提交按钮生效？
