_posts/2013-04-14-Learning-Django.html

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">第十章 数据模型高级进阶</h2>
<div class="outline-text-2" id="text-10">

<p>  土曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-05-11 Sat</span></span>
</p>
<ol>
<li>打开Session功能：



<pre class="example">'django.contrib.sessions.middleware.SessionMiddleware'

INSTALLED_APPS 中有 'django.contrib.sessions'

(别忘了运行manage.py syncdb)

</pre>

</li>
<li>在视图中使用Session
<ul>
<li>SessionMiddleware 激活后，每个传给视图(view)函数的第一个参数``HttpRequest`` 
       对象都有一个 session 属性，这是一个字典型的对象。
</li>
</ul>

</li>
<li>会话密钥(session key)
</li>
<li>设置Cookies:
   <code>request.session.set_test_cookie()</code>
   后续view中：
   <code>request.seesion.test_cookie_worked()</code>
</li>
<li>认证(authentication)框架
</li>
<li>注意点：
<ul>
<li><code>session</code> 是在 <code>request</code> 中的， <code>set_cookie</code> 是在 <code>response=HttpResponse</code>

</li>
<li>被设置的 <code>session</code> 并不会在调试工具中的cookie出现

</li>
</ul>

</li>
<li>疑问点：
<ul>
<li>关于这些session属性怎么设置，直接写入setting.py文件么？
     参考地址：<a href="https://docs.djangoproject.com/en/dev/ref/settings/#sessions">https://docs.djangoproject.com/en/dev/ref/settings/#sessions</a>

</li>
<li>在设计登录表单时，如何判断输入的是合法字符，使得提交按钮生效？
</li>
</ul>

</li>
</ol>

</div>
</div>
